{
    // ***Config Options*** 5028 words (5541)
    //
    // Minimum Days Between Lessons
    "config.MinimumDaysBetweenLessons.name": "MinimumDaysBetweenLessons",
    "config.MinimumDaysBetweenLessons.description": "After kicking off the lessons, at least 7 days must pass between the lessons by default. This means it'd take at least 16 weeks in-game to see all the lessons. If you'd like to reduce the time between lessons to see them faster, or increase the time to spread out the lessons even more, you can! You can select a number between 1 day and 28 days for minimum days between lessons.",
    "config.MinimumDaysBetweenLessons.values.1": "1",
    "config.MinimumDaysBetweenLessons.values.2": "2",
    "config.MinimumDaysBetweenLessons.values.3": "3",
    "config.MinimumDaysBetweenLessons.values.4": "4",
    "config.MinimumDaysBetweenLessons.values.5": "5",
    "config.MinimumDaysBetweenLessons.values.6": "6",
    "config.MinimumDaysBetweenLessons.values.7": "7",
    "config.MinimumDaysBetweenLessons.values.8": "8",
    "config.MinimumDaysBetweenLessons.values.9": "9",
    "config.MinimumDaysBetweenLessons.values.10": "10",
    "config.MinimumDaysBetweenLessons.values.11": "11",
    "config.MinimumDaysBetweenLessons.values.12": "12",
    "config.MinimumDaysBetweenLessons.values.13": "13",
    "config.MinimumDaysBetweenLessons.values.14": "14",
    "config.MinimumDaysBetweenLessons.values.15": "15",
    "config.MinimumDaysBetweenLessons.values.16": "16",
    "config.MinimumDaysBetweenLessons.values.17": "17",
    "config.MinimumDaysBetweenLessons.values.18": "18",
    "config.MinimumDaysBetweenLessons.values.19": "19",
    "config.MinimumDaysBetweenLessons.values.20": "20",
    "config.MinimumDaysBetweenLessons.values.21": "21",
    "config.MinimumDaysBetweenLessons.values.22": "22",
    "config.MinimumDaysBetweenLessons.values.23": "23",
    "config.MinimumDaysBetweenLessons.values.24": "24",
    "config.MinimumDaysBetweenLessons.values.25": "25",
    "config.MinimumDaysBetweenLessons.values.26": "26",
    "config.MinimumDaysBetweenLessons.values.27": "27",
    "config.MinimumDaysBetweenLessons.values.28": "28",
    //
    // Skippable
    "config.SkippableConfig.name": "SkippableConfig",
    "config.SkippableConfig.description": "Specify if you want the events in the series to be skippable (true, false). Default is false. Useful for repeat playthroughs if you want to pick and choose which events you see, or if you're worried about getting stuck during an event due to a mod that changes maps.",
    "config.SkippableConfig.values.true": "true",
    "config.SkippableConfig.values.false": "false",
    //
    // Skippable
    "config.PortraitandSpriteOverlayConfig.name": "PortraitandSpriteOverlayConfig",
    "config.PortraitandSpriteOverlayConfig.description": "Specify if you want the Maru electronics lesson to include a portrait and sprite overlay as a fun feature. Default is true. The overlays were designed for vanilla and the Diverse Stardew (DSV) mod. If you use any other portrait or sprite mod that affect Maru, Jas, and/or Vincent, you may want to set this to false for immersion.",
    "config.PortraitandSpriteOverlayConfig.values.true": "true",
    "config.PortraitandSpriteOverlayConfig.values.false": "false",
    //
    // Edit Penny 8 Heart Event // Add note about compat
    "config.EditPenny8HeartEvent.name": "EditPenny8HeartEvent",
    "config.EditPenny8HeartEvent.description": "For immersion reasons, Penny's 8 heart event is tweaked to include a reference to the lessons. Set this to false if you have another mod that edits Penny's 8 heart event. Default is true.",
    "config.EditPenny8HeartEvent.values.true": "true",
    "config.EditPenny8HeartEvent.values.false": "false",
    //
    //
    // ***Event and CT strings***
    // Penny Kickstarts Lessons event
    "event-31032022.01": "Hi @...$s",
    "event-31032022.02": "What's got you down, Penny?",
    "event-31032022.03": "Lovely day, isn't it?",
    "event-31032022.04": "Is it that obvious?$s",
    "event-31032022.05": "I suppose it is...$s",
    "event-31032022.06": "I'm concerned about how my lessons are going with the kids.$3#$b#I'm worried that they may be losing interest when it's always me teaching, and my materials are limited.$s",
    "event-31032022.07": "Maybe I could get some of the people around town to be guest lecturers!$h#$b#They can share some of what they know with the kids. What do you think?",
    "event-31032022.08": "I think that's a great idea!",
    "event-31032022.09": "If you say so.",
    "event-31032022.10": "The kids wouldn't pay attention anyways.",
    "event-31032022.11": "I'm glad you agree! It'll spice things up to have different teachers.$h",
    "event-31032022.12": "Yes, I think this will work!",
    "event-31032022.13": "I don't think that's fair to say.$a#$b#They love new topics in class. I really think that they would enjoy hearing from other people too.$3",
    "event-31032022.14": "Well, I better get going. I have a lot of people to convince to give lessons!$l",
    // Penny Kickstarts Lessons CTs
    "ItTakesAVillage_BeginningCT_Jodi": "Hmm. I hope Vincent doesn't come home with strange facts.$2",
    "ItTakesAVillage_BeginningCT_Kent": "Vincent said Penny's getting the townspeople involved in classes.#$b#It's good she's taking their education seriously.$h",
    "ItTakesAVillage_BeginningCT_Sam": "I hope Penny asks me about teaching a class. I'm stoked to 'dispense knowledge'.$h",
    "ItTakesAVillage_BeginningCT_Marnie": "I'm glad Jas will learning different things in class. It'll be good to get her thinking.$h",
    "ItTakesAVillage_BeginningCT_Shane": "Jas has been talking up a storm about guest lecturers. If Penny's asking everyone in town, it could go badly.$2#$b#What? Not everyone is suited for teaching.$3",
    //
    // Alex PE and Healthy Eating event
    "event-31032023.01": "Hi there @! Join our class!",
    "event-31032023.02": "Ok, first up: who knows what are some healthy foods?",
    "event-31032023.03": "Think back to Gus' lesson on cooking.",
    "event-31032023.04": "Does mayonnaise count?$3",
    "event-31032023.05": "What? No bud, unfortunately it doesn't.$7",
    "event-31032023.06": "Don't laugh at me Jas! Mr. Alex, please do something!$s",
    "event-31032023.07": "*ahem* Jas? Maybe apologize to Vincent?$9",
    "event-31032023.08": "Yes, that wasn't very nice, Jas.",
    "event-31032023.09": "(Say nothing)",
    "event-31032023.10": "It's Vincent's fault for saying something silly.",
    "event-31032023.11": "Even @ agrees with me, Jas.",
    "event-31032023.12": "... I'm sorry Vincent.$3",
    "event-31032023.13": "*sniff*$s",
    "event-31032023.14": "That's not helpful, @.$a#$b#Jas?$9",
    "event-31032023.15": "Alright then. Jas, what are some healthy foods you know?",
    "event-31032023.16": "Fruits and vegetables, like apples and cauliflower!$4",
    "event-31032023.17": "Yes, good choices.",
    "event-31032023.18": "We can't forget about protein though. Lentils are high in protein-",
    "event-31032023.19": "What?! First no mayonnaise, now lentils?!$s",
    "event-31032023.20": "You know what bud, meat is also high in protein. My favorite is salmon. That's some good eating.",
    "event-31032023.21": "Oh. Mom makes bass for dinner sometimes. It's ok.$3",
    "event-31032023.22": "See? That's good!#$b#To stay healthy you want to have fruits and vegetables like Jas mentioned, and protein as well.#$b#But! Healthy living wouldn't be complete without some exercise. Being active helps improve your mood and reduces the chances you'll get sick.",
    "event-31032023.23": "Oh... You don't mean push ups and sit ups, do you?$3",
    "event-31032023.24": "I hope not, that sounds boring.$3",
    "event-31032023.25": "Actually that brings up an excellent point, Vincent!",
    "event-31032023.26": "Any good habit is hard to build, right? Like making your bed every day.#$b#With exercise, you want to find something you like to do and will want to keep doing.#$b#If you don't, it becomes a chore and you lose motivation to keep exercising.",
    "event-31032023.27": "So, what do you like to do that involves moving around?",
    "event-31032023.28": "I like to jump rope.",
    "event-31032023.29": "Um... I guess I like running.",
    "event-31032023.30": "Nice! Let's have Jas jump some rope, Vincent you can run, and I'll throw this ball around a bit!$h",
    // Alex PE and Healthy Eating CTs
    "ItTakesAVillage_AlexPECT_Alex_NoCooking": "I hear Gus is planning his lesson around healthy eating, that's some good synergy!$h",
    "ItTakesAVillage_AlexPECT_Alex_YesCooking": "I'm glad we're talking about healthy eating in different ways to the kids.",
    "ItTakesAVillage_AlexPECT_Gus_NoCooking": "It'll be good for the kids to see how to make one of the healthy foods Alex talked about.",
    "ItTakesAVillage_AlexPECT_Gus_YesCooking": "Now the kids have seen that exercise can be a form of stress relief too, not just cooking.",
    "ItTakesAVillage_AlexPECT_Jas": "I like jumping rope!",
    "ItTakesAVillage_AlexPECT_Vincent": "Running is so much fun!",
    "ItTakesAVillage_AlexPECT_George": "Alex seems to have a way with the kids.",
    "ItTakesAVillage_AlexPECT_Evelyn": "Alex looked happy after that class.$h#$b#Maybe he has it in him to coach.",
    "ItTakesAVillage_AlexPECT_Jodi": "I wish Alex had specified running *outside*...$2#$b#At least Vincent seems more excited about eating fish.",
    "ItTakesAVillage_AlexPECT_Kent": "I'm glad Vincent is excited about being active.$h",
    "ItTakesAVillage_AlexPECT_Sam": "I could take Vincent running with me while I do some rad tricks on my skateboard.",
    "ItTakesAVillage_AlexPECT_Marnie": "Jas seemed happy with herself.$h",
    "ItTakesAVillage_AlexPECT_Shane": "I feel like Jas has been jumping rope more lately.",
    "ItTakesAVillage_AlexPECT_Penny": "It was great to see Alex explain healthy eating and exercise in a way that motivated the kids.",
    //
    // Gus Cooking event
    "event-31032024.01": "Hello young'uns! Are you ready to do some cooking?",
    "event-31032024.02": "I'm excited to learn, it'll be a way to apply what Alex talked about!$h",
    "event-31032024.03": "Today will be light, since I realized it would be too dangerous to introduce you to the stove!#$b#We will make a nice and healthy salad!$h",
    "event-31032024.04": "I'll make it first, and then you'll try!",
    "event-31032024.05": "We've got our ingredients here. While the recipe calls for a specific quantity of each ingredient, cooking is more than just following a recipe.#$b#Once you know the basics, you can add or change ingredients, to get a different mix of flavors. That way, you're putting your own spin on the dish.#$b#Think about what your special ingredient or quantity might be.",
    "event-31032024.06": "... That's ok, I just want to stick to the recipe.$3",
    "event-31032024.07": "Don't mind me, adding my secret dressing blend...",
    "event-31032024.08": "Ok, now it's your turn!",
    "event-31032024.09": "Yay!",
    "event-31032024.10": "I want to try adding more leeks to mine!$h",
    "event-31032024.11": "Ok, Jas, could you pass the leeks?",
    "event-31032024.12": "Jas?",
    "event-31032024.13": "How big should the leek pieces be?$3#$b#What if I don't put enough dandelions and it doesn't turn out good?$3#$b#Will Mr. Gus be upset if I do it wrong and waste all his ingredients?$s",
    "event-31032024.14": "Oh, Jas, it's ok! There is no pressure here. Take it one step at a time if you're feeling overwhelmed, alright?",
    "event-31032024.15": "*sniff* Yes, Mr. Gus.$s",
    "event-31032024.16": "Well, will you look at that! We all made our own unique salads!$h",
    "event-31032024.17": "Say thank you to Gus, now.",
    "event-31032024.18": "Thanks Mr. Gus! I didn't think cooking would be this fun!",
    "event-31032024.19": "... Thank you Mr. Gus. I'm sorry I got upset.$3",
    "event-31032024.20": "You're welcome, kids. It's ok to feel stressed.",
    "event-31032024.21": "With more experience, I'm sure you'll both make great meals while keeping your cool!$h",
    "event-31032024.22": "Now let's dig in!$h",
    // Gus Cooking CTs
    "ItTakesAVillage_GusCookingCT_Gus_NoPE": "Hopefully Jas isn't as stressed going forward.#$b#Cooking for me is an excellent outlet for creativity as well as stress relief. I think Vincent saw that!",
    "ItTakesAVillage_GusCookingCT_Gus_YesPE": "I'm glad Alex and I sort of teamed up on healthy eating!$h#$b#It's a good message to hear from different sources.#$b#Maybe that will make it more fun for Vincent and easier for Jas to cook going forward.",
    "ItTakesAVillage_GusCookingCT_Alex_NoPE": "I'm pumped to help reinforce the message of healthy foods with the kids.",
    "ItTakesAVillage_GusCookingCT_Alex_YesPE": "I heard the kids learned how to make a salad.#$b#I couldn't live without my protein though.$h#$b#Maybe I could ask Gus about the recipe and add nuts on top...",
    "ItTakesAVillage_GusCookingCT_Emily": "Gus handled that tough moment well.$s#$b#I'll send Jas some positive vibes. It sounded like Vincent has positive vibes of his own!",
    "ItTakesAVillage_GusCookingCT_Jas": "%Jas looks a little embarrassed. Best to leave her be.",
    "ItTakesAVillage_GusCookingCT_Vincent": "I love cooking! You get to try all sorts of flavors!$h#$b#It's ok if Jas doesn't like it too much, I can help cook for her!",
    "ItTakesAVillage_GusCookingCT_Jodi": "I'm glad to hear Vincent enjoyed cooking, and that Gus chose such a smart and healthy choice.#$b#I think I'll ask Vincent to make that salad as an accompaniment for dinner.#$b#Hopefully Sam learns something from his brother on this.$h",
    "ItTakesAVillage_GusCookingCT_Kent": "It's great the salad the kids made is out of forage. I wonder if it'll get them thinking more about living off the land.$h",
    "ItTakesAVillage_GusCookingCT_Sam": "Mom's really proud of Vincent learning to make a salad. Me, I still love pizza!$h#$b#We should have a bro cooking night and make one with our own toppings.",
    "ItTakesAVillage_GusCookingCT_Marnie": "Poor Jas.$s#$b#I'll try to include her in meal prep more often, see if that helps her feel more comfortable in the kitchen.",
    "ItTakesAVillage_GusCookingCT_Shane": "I'll be sure to remind Jas she has options and there's no shame in microwaving food.",
    "ItTakesAVillage_GusCookingCT_Penny": "I'm thankful that Gus handled Jas' stress so gently, poor thing.#$b#Vincent seems quite enthusiastic, at least!",
    //
    // Elliott Stories event
    "event-31032025.01": "Hello everyone! Today we'll start with reading a short story, and then you'll work on a little exercise.#$b#I've provided a copy of the story so you can follow along to my illustrious narration. Please, sit.",
    "event-31032025.02": "There once was a band of misfits: Nuru the quick and cunning bard, Makena the strong and bold warrior, and Amari the steady and wise mage.#$b#They were thrust together by happenstance, united only by a common goal: to find the treasure of the great Ashanti...",
    "event-31032025.03": "Standing in the empty tomb, they looked at each other and realized that the real treasure was the friends they made along the way.$h#$b#The end.$h",
    "event-31032025.04": "What did you each like about the story?",
    "event-31032025.05": "Hmm... I really liked learning the new words in the story, through synonyms.",
    "event-31032025.06": "I was surprised there were no treasure chests at the end. I liked the friendship between Makena, Nuru, and Amari!",
    "event-31032025.07": "Excellent findings, both of you!$h#$b#Now, let's have you write your own short stories.#$b#Jas, you can focus on using synonyms for vivid diction. Vincent, you can focus on creating a situation with a surprising end.",
    "event-31032025.08": "... Plans foiled for the final time, Pax fumed in the wagon, heading for prison down the windy road.$4",
    "event-31032025.09": "That was absolutely brilliant, Jas! I could picture all of it in my mind!$h",
    "event-31032025.10": "Now it's Vincent's turn!",
    "event-31032025.11": "The cracks in the ground finally split open into a big hole, and the heroes were trapped!#$b#They were never heard from again...$3",
    "event-31032025.12": "The horror!$8#$b#Well done, Vincent! You surprised me, but you planted the seeds of the outcome well with the cracks.$h",
    "event-31032025.13": "Thanks for all the positive feedback, Elliott! I think you've really inspired the kids.$h",
    // Elliott Stories CTs
    "ItTakesAVillage_ElliottStoriesCT_Elliott_NoArt": "I only did what I wish teachers would have done for me at their age: helped me 'play to my strengths', or interests, so to speak.#$b#Hopefully Leah and Haley encourage them as well in their lesson.",
    "ItTakesAVillage_ElliottStoriesCT_Elliott_YesArt": "", // Customize based on what happens in the art lesson
    "ItTakesAVillage_ElliottStoriesCT_Leah_NoArt": "I wish I'd been there for Elliott's dramatic reading!$h#$b#Hopefully Haley and I can match that quality in our lesson.",
    "ItTakesAVillage_ElliottStoriesCT_Leah_YesArt": "I wish I'd been there for Elliott's dramatic reading!$h#$b#It's great the kids are getting exposed to different aspects of art.",
    "ItTakesAVillage_ElliottStoriesCT_Jas": "%Jas appears lost in thought.",
    "ItTakesAVillage_ElliottStoriesCT_Vincent": "%Vincent seems to be talking to himself about trapping heroes in unusual situations.",
    "ItTakesAVillage_ElliottStoriesCT_Jodi": "I hope writing is only a phase for Vincent. I just don't think it's a profitable career path.$s#$b#Look at that long haired man, living in a shack on a beach.$s",
    "ItTakesAVillage_ElliottStoriesCT_Kent": "Jodi doesn't give Vincent enough credit. He can have fun with writing stories at his age.#$b#If he's good at it, I don't see the problem with him thinking about it as a career.",
    "ItTakesAVillage_ElliottStoriesCT_Sam": "Alright, Vincent and I, the sensitive artist brothers!$h",
    "ItTakesAVillage_ElliottStoriesCT_Marnie": "Jas was so precious after Elliott's lesson. She asked me to put her story up on the fridge!$h",
    "ItTakesAVillage_ElliottStoriesCT_Shane": "Look at Jas, little wordsmith at such a young age.$6",
    "ItTakesAVillage_ElliottStoriesCT_Penny": "Jas was the most thrilled I've seen her, thinking up different words for the same expression. Vincent was also enthusiastic, coming up with interesting characters.#$b#We may have future writers in our hands! Elliott did a wonderful job encouraging them.$h",
    //
    // Abigail Economics event
    "event-31032027.01": "Alright kiddos! Who's up for a little econ 101?$h",
    "event-31032027.02": "Hi @, I was just about to start a little lesson.",
    "event-31032027.03": "Hopefully this goes well today...$3",
    "event-31032027.04": "Ok, for our first example: Gus comes into Dad's store to buy some supplies for the Saloon.#$b#If he wants to buy 3 boxes wheat flour at 100 each, 1 jar of sugar at 100 each, and 2 bottles of vinegar at 200 each,#$b#what's the total Gus owes?",
    "event-31032027.05": "Um, Ms. Abigail, could you repeat the question?$3",
    "event-31032027.06": "Sure! This time I'll get some visual aids.$h",
    "event-31032027.07": "3 boxes of wheat flour costing 100 each,",
    "event-31032027.08": "1 jar of sugar costing 100 each,",
    "event-31032027.09": "2 bottles of vinegar costing 200 each.",
    "event-31032027.10": "Hopefully all the props don't inconvenience anyone trying to shop.",
    "event-31032027.12": "Ha, if anyone complains I'll tell them it's in the name of education.$h",
    "event-31032027.13": "Ms. Abigail, I think I know!",
    "event-31032027.14": "Well come on up here and tell me, let's give Vincent a chance to work through it.",
    "event-31032027.15": "That's correct!$h",
    "event-31032027.16": "800?!",
    "event-31032027.17": "You got it!$h",
    "event-31032027.18": "Ok, now what happens if Gus only has 1000? How much change would he get?",
    "event-31032027.19": "Right again!$h",
    "event-31032027.20": "200?",
    "event-31032027.21": "You got it again! Great crowd!$h",
    // Abigail Economics CTs
    "ItTakesAVillage_AbbyEconCT_Abigail": "I'm glad I got both of the kiddos involved in the lesson, at their own pace.",
    "ItTakesAVillage_AbbyEconCT_Sebastian_YesSebComputer": "I guess basic arithmetic was more their speed...$s",
    "ItTakesAVillage_AbbyEconCT_Sebastian_NoSebComputer": "Hmm, basic arithmetic? I think what I have in store is more exciting.",
    "ItTakesAVillage_AbbyEconCT_Jas": "Ms. Abigail is such a good teacher.",
    "ItTakesAVillage_AbbyEconCT_Vincent": "I'd take another class with Ms. Abigail any day!",
    "ItTakesAVillage_AbbyEconCT_Caroline": "I wouldn't have expected Abby to enjoy teaching so much. I'm happy she found this outlet.",
    "ItTakesAVillage_AbbyEconCT_Pierre": "Thankfully Abigail straightened up after her class was over.#$b#... Alright, I suppose I'm also proud she took an interest in the business.$h",
    "ItTakesAVillage_AbbyEconCT_Jodi": "Vincent came home rattling off numbers nonstop...$2",
    "ItTakesAVillage_AbbyEconCT_Kent": "That young lad was... excitable.",
    "ItTakesAVillage_AbbyEconCT_Sam": "Uh... I never would have guessed Vincent would like math this much. Guess we're different there.$10",
    "ItTakesAVillage_AbbyEconCT_Marnie": "Jas looked so proud after the math class.#$b#I'm glad it went well.$h",
    "ItTakesAVillage_AbbyEconCT_Shane": "Jas has been counting her toys and pretending she's selling them.#$b#Maybe the class got her thinking about being an entrepreneur!$6",
    "ItTakesAVillage_AbbyEconCT_Penny": "Abigail's examples were great for the kids to visualize the concepts.",
    //
    // Sebastian Computer Basics event
    "event-31032028.01": "This is an odd spot.$3",
    "event-31032028.02": "Gunther here was particular about the space.",
    "event-31032028.03": "Indeed. I don't like anyone moving my furniture.",
    "event-31032028.04": "(Pierre was a little more encouraging.)$3",
    "event-31032028.05": "(At least we're allowed here at all.)$2",
    "event-31032028.06": "Alright, let's get to it.",
    "event-31032028.07": "I already booted up the computer and have Turtle open.",
    "event-31032028.08": "The program most people start with is getting the console to print text.",
    "event-31032028.09": "Mr. Sebastian... what's a program?$3",
    "event-31032028.10": "It's just a set of instructions to control a computer. We'll use a simple print function.",
    "event-31032028.11": "We use parentheses to indicate we're calling a function, but they can also be used to create new objects.",
    "event-31032028.12": "Meanwhile, we use the quotation marks to indicate that we're trying to display string literals, or characters.",
    "event-31032028.13": "Let's stay focused on what Sebastian is trying to show us.",
    "event-31032028.14": "Nothing's happening.$3",
    "event-31032028.15": "The program takes time to run.",
    "event-31032028.16": "Hello world",
    "event-31032028.17": "All your bases are belong to me!",
    "event-31032028.18": "See? There!#$b#I can use Turtle to make the computer do all kinds of stuff!$h",
    "event-31032028.19": "Um... ok.$3#$b#Thank you, Mr. Sebastian.",
    "event-31032028.20": "When Ms. Abigail showed us a computer, it had a lot more flashing lights and it was fun.$3",
    "event-31032028.21": "That's a different kind of computer.$a",
    // Sebastian Computer Basics CTs
    "ItTakesAVillage_SebComputerCT_Sebastian": "I'm... not really sure how that class went, to be honest.",
    "ItTakesAVillage_SebComputerCT_Abigail_NoEconYesVG": "Pff, as if Seb's programming had a chance after I introduced the kiddos to gaming.$h",
    "ItTakesAVillage_SebComputerCT_Abigail_NoEconNoVG": "Hehe, I think my interactive math class will go over better.",
    "ItTakesAVillage_SebComputerCT_Abigail_YesEconYesVG": "Pff, as if Seb's programming had a chance after I wowed the kids with an interactive math class AND introduced themselves to gaming.$h",
    "ItTakesAVillage_SebComputerCT_Abigail_YesEconNoVG": "Hehe, the kids definitely had more fun in my interactive math class.",
    "ItTakesAVillage_SebComputerCT_Jas": "Controlling a computer doesn't seem fun.$3",
    "ItTakesAVillage_SebComputerCT_Vincent": "I guess Mr. Sebastian plays with a turtle in the computer. It doesn't look like a turtle though.$3",
    "ItTakesAVillage_SebComputerCT_Robin": "I wasn't sure how well Sebastian would do with the kids...#$b#Maybe older students would be easier for him to teach?",
    "ItTakesAVillage_SebComputerCT_Maru": "It's a shame Jas and Vincent weren't all that interested in programming.#$b#Still, their interests may lie elsewhere.",
    "ItTakesAVillage_SebComputerCT_Jodi": "I'm glad Vincent wasn't enthused about computers.#$b#Don't need his brain rotting with screen time.",
    "ItTakesAVillage_SebComputerCT_Kent": "I'm not proud to admit it, but I'm relieved Vincent wasn't interested in Sebastian's class.#$b#I wouldn't be able to help him operate that doohickey.",
    "ItTakesAVillage_SebComputerCT_Sam": "Don't tell Seb, but I'm pumped I'll stay number one in Vincent's heart.",
    "ItTakesAVillage_SebComputerCT_Marnie": "Jas didn't seem very excited about Sebastian's class. I wonder what happened.$3",
    "ItTakesAVillage_SebComputerCT_Shane": "Pff, of course that recluse didn't do well with kids.$3#$b#What are you looking at?",
    "ItTakesAVillage_SebComputerCT_Penny": "The kids were not very talkative about this lesson...$3",
    //
    // Maru Electronics event
    "event-31032030.01": "Who's ready for some time with Maru the Science Guru?!$h",
    "event-31032030.02": "You've had some fun with nature and bugs, now we'll have some fun in the lab!#$b#Who's ready for some time with Maru the Science Guru?!$h",
    "event-31032030.03": "I don't know if this will live up to the bird hype, but here goes.$s#$b#Who's ready for some time with Maru the Science Guru?!",
    "event-31032030.04": "Alright, goggles on!$h",
    "event-31032030.05": "Ms. Maru, doesn't Ms. Penny need safety googles too?",
    "event-31032030.06": "Penny is sitting a safe enough distance away that she gets a pass today.",
    "event-31032030.07": "To start us off today, a question! Do either of you know what a battery does?",
    "event-31032030.08": "Batteries make computers work?$3",
    "event-31032030.09": "That's one of the uses, yes!",
    "event-31032030.10": "Very basically, a battery stores chemical energy to convert it to electrical power.#$b#Today, we'll make a potato battery to power a light bulb!$h",
    "event-31032030.11": "The potato itself isn't the energy source.#$b#It only conducts electricity between two metals, which allows the electrons to move freely to create electricity.",
    "event-31032030.12": "Ms. Maru, what's an electron?$3",
    "event-31032030.13": "Great question, Vincent!$3",
    "event-31032030.14": "An electron is a subatomic particle that has a negative charge.",
    "event-31032030.15": "We could do a deep dive into atoms and subatomic particles!$4",
    "event-31032030.16": "Maybe it would be better to show it through the experiment, Maru?",
    "event-31032030.17": "Good point, Penny!",
    "event-31032030.18": "Phew...",
    "event-31032030.19": "Let's get to it!#$b#I boiled this potato first, which makes it produce ten times the power!$3",
    "event-31032030.20": "Ms. Maru, why does boiling the potato make it so powerful?$3",
    "event-31032030.21": "Excellent question, Jas!$3",
    "event-31032030.22": "Boiling the potato helps break down resistance in the flesh of the potato, so the electrons flow more freely.",
    "event-31032030.23": "Alright, for our first step here, I will prepare the wires and this copper coin, and slice the potato...",
    "event-31032030.24": "There! Who wants to be my first helper?",
    "event-31032030.25": "Me!!",
    "event-31032030.26": "I love the enthusiasm!$h#$b#Jas, you can put the end of the wire with the coin into the potato slit here...",
    "event-31032030.27": "Looking good!#$b#For the next step...",
    "event-31032030.28": "Voila!$h",
    "event-31032030.29": "Did you know that a potato battery can power a room for over a month?$3",
    "event-31032030.30": "Oooh!",
    "event-31032030.31": "Cool!",
    "event-31032030.32": "Nice job everyone! Say thanks to Maru for the lesson!",
    "event-31032030.33": "Thanks!",
    "event-31032030.34": "You're welcome! Maru the Science Guru is happy to teach you about science any time!$h",
    // Maru Electronics CTs
    "ItTakesAVillage_MaruElectronicsCT_Demetrius_YesBug": "Our young students enjoyed both their botany lesson and the potato battery experiment.",
    "ItTakesAVillage_MaruElectronicsCT_Demetrius_YesCrow": "Our young students enjoyed both their botany lesson and the potato battery experiment.#$b#I suppose despite Maru, Penny, and Robin's worries, the greater glossy puffle didn't take over the students' attention.$h",
    "ItTakesAVillage_MaruElectronicsCT_Demetrius_NoBugorCrow": "I heard the potato battery experiment went well.#$b#If our young students haven't fallen in love with science yet, they will after my nature tour!$h",
    "ItTakesAVillage_MaruElectronicsCT_Maru_YesBug": "Yep, called it. The kids are definitely future lab assistants!$h",
    "ItTakesAVillage_MaruElectronicsCT_Maru_YesCrow": "I'm glad the big bird faded enough from the kids' memory to enjoy the potato battery.#$b#I wasn't sure how well that would go.$s",
    "ItTakesAVillage_MaruElectronicsCT_Maru_NoBugorCrow": "Jas picked up the concepts pretty well!#$b#Vincent had fun with the goggles too, so a little something for everyone!$h",
    "ItTakesAVillage_MaruElectronicsCT_Robin": "Maru was as excited as the kids were, raving about 'Maru the Science Guru'. I'm glad to hear they had a blast.",
    "ItTakesAVillage_MaruElectronicsCT_Jas": "Experiments are a lot of fun.",
    "ItTakesAVillage_MaruElectronicsCT_Vincent": "I want to keep the goggles!",
    "ItTakesAVillage_MaruElectronicsCT_Jodi": "Science is a respectable field.#$b#It's a shame Vincent was more interested in the apparel.$s",
    "ItTakesAVillage_MaruElectronicsCT_Kent": "I don't think Vincent's focus on the goggles is the worst thing.#$b#Safety is important.$h",
    "ItTakesAVillage_MaruElectronicsCT_Sam": "I think I'll get Vincent some sunglasses.$h#$b#No, they're not the same as goggles.#$b#They're cooler.$3",
    "ItTakesAVillage_MaruElectronicsCT_Marnie": "Jas came home singing about electrons and a science guru.$h",
    "ItTakesAVillage_MaruElectronicsCT_Shane" : "I wasn't following everything Jas said, but it's nice to see her excited about science.$6",
    "ItTakesAVillage_MaruElectronicsCT_Penny": "Maru the Science Guru~!$h#$b#Oh! @!$l#$b#It's a catchy song, ok?$l",
    //
    // Demetrius Botany event
    "event-31032029.01": "Greetings, young ones! Are you ready for some botany?$h",
    "event-31032029.02": "First up on our tour, a conifer tree of the family Pinaceae! More commonly known as a pine tree. Its seeds are the pinecones, famously used for decorations.#$b#But, did you know some cultures grind pinecones and use them as flour? It's a great source of protein!",
    "event-31032029.03": "My mom just buys flour.$3",
    "event-31032029.04": "*ahem* Moving right along!",
    "event-31032029.05": "Ah, here we have some seasonal forage!",
    "event-31032029.06": "Salmonberry is rubus spectabilis, part of the rose family Rosaceae.#$b#From a botanical perspective, it's not a real berry, but an aggregate fruit!$3#$b#They prefer coastal areas with nitrogen-rich soils, like moist forests and streambanks.",
    "event-31032029.07": "Spice berry is ardisia crenata, part of the primrose family, Primulaceae.#$b#In some parts of Ferngill, it's what's known as an invasive species,$2#$b#because it competes with native plants and can either eliminate or hybridize with them.$2",
    "event-31032029.08": "Blackberry is a genus rubus in the family Rosaceae.#$b#From a botanical perspective, it's not a real berry, but an aggregate fruit!$3#$b#Still, they are quite hardy, and thrive even in poor soil like wastelands, ditches, and vacant lots.",
    "event-31032029.09": "Holly is Ilex aquifolium in the family Aquifoliaceae.#$b#From a botanical perspective, it's not a real berry, but a drupe!$3#$b#If a person eats holly, they will get sick, but it's an important food for birds and others animals.",
    "event-31032029.10": "Mr. Demetrius, what's nitrogen?$3",
    "event-31032029.11": "Mr. Demetrius, what does hybridize mean?$3",
    "event-31032029.12": "Mr. Demetrius, what's an aggregate fruit?$3",
    "event-31032029.13": "Mr. Demetrius, what's a drupe?$3",
    "event-31032029.14": "Great question, Vincent! Nitrogen is the most common element in the universe.#$b#For plants, it's a nutrient that helps keep them healthy. Like a vitamin does for humans!$h",
    "event-31032029.15": "Great question, Vincent! When one plant hybridizes with another, it means they reproduce together.#$b#The spice berry is 'joining' the native plants if it doesn't kill them off!$2",
    "event-31032029.16": "Great question, Vincent! An aggregate fruit is made of many smaller drupelets.#$b#One drupe is a fruit with an outer flesh surrounding a shell with a seed inside.#$b#Our blackberry has company in the aggregate fruit club with raspberries!",
    "event-31032029.17": "Great question, Vincent! A drupe is a fruit with an outer flesh surrounding a shell with a seed inside.#$b#Our holly has company in the drupe club with peaches!",
    "event-31032029.30": "It's fun to see different types of science, isn't it?$h",
    "event-31032029.18": "Any other ques-",
    "event-31032029.19": "Did you hear that?",
    // Demetrius Botany Birb edition    
    "event-31032029.20": "Aren't we lucky? That was a greater glossy puffle, right here in the valley!$6",
    "event-31032029.21": "Um... I don't think that's right...$3",
    "event-31032029.22": "Aha, a lot of people think it looks like a grand fluffy crow! They look very similar, but there's certain key differences if you look closely.$h#$b#Did you notice the bill, legs, and feet, how yellow they were?#$b#That's how you know.$h",
    "event-31032029.23": "Ok. Thank you, Mr. Demetrius.$3",
    "event-31032029.24": "You're welcome! Let's continue with the nature tour.$h",
    // Demetrius Botany Bug edition
    "event-31032029.25": "Aren't we lucky? That was an iridescent borer-scarab, right here in the valley!$6",
    "event-31032029.26": "Um... I think they're common here, I've heard the man from the guild say they live in the mines...$3",
    "event-31032029.27": "That's still a treat for us, Jas! We're not likely to venture in there.$h#$b#After all, it's not safe.#$b#There are also unique crabs and a whole host of other creatures. What I would give to be able to study them safely.",
    "event-31032029.28": "That's so cool, Mr. Demetrius!",
    "event-31032029.29": "Well, let's continue with the nature tour.$h",
    // Demetrius Botany CTs
    // Demetrius Botany Birb edition
    "ItTakesAVillage_DemetriusBotanyCT_Demetrius_NoElectronicsCrow": "It was great to share botany knowledge with more than just Maru, although of course that's great too.$h#$b#Oh, the greater glossy puffle? Yes, it was quite a marvelous sight.",
    "ItTakesAVillage_DemetriusBotanyCT_Demetrius_YesElectronicsCrow": "It was great to share botany knowledge with more than just Maru, although of course that's great too.$h#$b#She also seemed to enjoy sharing her knowledge of electronics, so enjoying teaching might run in the family.$h#$b#Oh, the greater glossy puffle? Yes, it was quite a marvelous sight.",
    "ItTakesAVillage_DemetriusBotanyCT_Maru_NoElectronicsCrow": "I don't know if I can compete with a cool big bird.$2",
    "ItTakesAVillage_DemetriusBotanyCT_Maru_YesElectronicsCrow": "Wow, I'm glad my lesson didn't have to follow that bird!$h",
    "ItTakesAVillage_DemetriusBotanyCT_RobinCrow": "Demetrius is brave to have underreacted as much as he did to that... what did he call it? 'Greater glossy puffle'?$h#$b#I would have run back into the house!$h",
    "ItTakesAVillage_DemetriusBotanyCT_LewisCrow": "I am STUNNED to hear such a creature was in our valley!$2#$b#I will have to have strong words with Marlon about keeping the valley safe.$3",
    "ItTakesAVillage_DemetriusBotanyCT_JasCrow": "%Jas looks a little haunted.",
    "ItTakesAVillage_DemetriusBotanyCT_VincentCrow": "Can you believe it? I've NEVER seen a bird that big!$h",
    "ItTakesAVillage_DemetriusBotanyCT_JodiCrow": "%Jodi is muttering to herself about safety in the mountains.",
    "ItTakesAVillage_DemetriusBotanyCT_KentCrow": "I'm with Jodi on this, I'm glad no one was carried off by that bird.#$b#Maybe the guild should look into that thing's migration patterns.",
    "ItTakesAVillage_DemetriusBotanyCT_SamCrow": "I am so glad Penny, the kids, and Demetrius were ok. I would have lost it if I saw an animal that big.$8",
    "ItTakesAVillage_DemetriusBotanyCT_MarnieCrow": "I can only imagine how scary that was for everyone.$2",
    "ItTakesAVillage_DemetriusBotanyCT_ShaneCrow": "I don't think I want Jas going up to the mountains any time soon.$3#$b$Or ever.",
    "ItTakesAVillage_DemetriusBotanyCT_PennyCrow": "I think that huge bird stole the show...$3#$b#Thankfully we were safe.$5",
    // Demetrius Botany Bug edition
    "ItTakesAVillage_DemetriusBotanyCT_Demetrius_NoElectronicsBug": "Maybe I could talk to the guild about a guided expedition into the mines?$3#$b#For science!#$b#Maybe Maru would join me. She might find something to inspire her electronics class.",
    "ItTakesAVillage_DemetriusBotanyCT_Demetrius_YesElectronicsBug": "Maybe I could talk to the guild about a guided expedition into the mines?$3#$b#For science!#$b#Maybe Maru would join me.",
    "ItTakesAVillage_DemetriusBotanyCT_Maru_NoElectronicsBug": "The kids already seem excited about science. Maybe after my class, they will be completely sold on being future lab assistants!$h",
    "ItTakesAVillage_DemetriusBotanyCT_Maru_YesElectronicsBug": "It's cool that Jas and Vincent got to see what my dad does.#$b#Combined with my electronics class, I think we may have some future lab assistants!$h",
    "ItTakesAVillage_DemetriusBotanyCT_RobinBug": "It was nice to hear Demetrius was able to share some of his love of science with the kids.",
    "ItTakesAVillage_DemetriusBotanyCT_LewisBug": "I thought Marlon was supposed to keep those vile things contained in the mines.$4",
    "ItTakesAVillage_DemetriusBotanyCT_JasBug": "Mr. Demetrius had so many cool facts about plants!",
    "ItTakesAVillage_DemetriusBotanyCT_VincentBug": "Can you believe it? I've never seen a bug that big!$h#$b#Mom probably wouldn't let me keep it as a pet.",
    "ItTakesAVillage_DemetriusBotanyCT_JodiBug": "Vincent's been talking about this colossal insect he saw in the mountains.$2#$b#I'm just glad it didn't sting or bite him.$2",
    "ItTakesAVillage_DemetriusBotanyCT_KentBug": "Vincent seemed enthusiastic about nature after that lesson.#$b#Maybe he'd be excited for more outdoor activities?$h",
    "ItTakesAVillage_DemetriusBotanyCT_SamBug": "Vincent's time up in the mountains sounds like it was more exciting than any time I've been there.$h",
    "ItTakesAVillage_DemetriusBotanyCT_MarnieBug": "I'm not sure how I would make pinecone flour. Don't some bugs live inside pinecones?$2",
    "ItTakesAVillage_DemetriusBotanyCT_ShaneBug": "Jas came home chattering about 'pinecone flour'. I don't think that will work for Marnie.$h",
    "ItTakesAVillage_DemetriusBotanyCT_PennyBug": "Vincent had trouble with saying the technical names, but both he and Jas had fun taking in nature.",
    //
    // Abigail Video Games event
    "event-31032033.01": "Hey kids! Don't tell Penny, but we have a ~special~ lesson today. Follow me!",
    "event-31032033.02": "Hey Gus, don't mind me, just taking the kids on a little field trip!",
    "event-31032033.03": "You be good to them, Abby.",
    "event-31032033.04": "Always!$h",
    "event-31032033.05": "Shout if you want snacks, I can bring you some rhubarb pie!",
    "event-31032033.06": "Shout if you want snacks, I can bring you some pink cake!",
    "event-31032033.07": "Shout if you want snacks, I can bring you some glazed yams!",
    "event-31032033.08": "Shout if you want snacks, I can bring you some cookies!",
    "event-31032033.09": "It's good to learn about metalworking, but we also need relaxation time, so, let me introduce you to video games!",
    "event-31032033.10": "It's good to learn about typical school topics, but we also need relaxation time, so, let me introduce you to video games!",
    "event-31032033.11": "Here, let me show you the controls...",
    "event-31032033.12": "COOL!$h",
    "event-31032033.13": "I got one!$h",
    "event-31032033.14": "Oh no, I died already!$3",
    // Abigail Video Games CTs
    "ItTakesAVillage_AbigailVideoGamesCT_Clint_YesMetalwork": "Well, that's practical.$s#$b#Metalworking can be fun too!... I guess.$s",
    "ItTakesAVillage_AbigailVideoGamesCT_Clint_NoMetalwork": "I don't think the lesson I had planned for the kids will complete with that.$s",
    "ItTakesAVillage_AbigailVideoGamesCT_Abigail": "It's good for the kids to have a little fun every now and then.$h",
    "ItTakesAVillage_AbigailVideoGamesCT_Caroline_YesAbby": "Hmph.$3.#$b#Well at least Abigail has taught the kids actual things, but I still don't approve of wasting their time with video games.$2",
    "ItTakesAVillage_AbigailVideoGamesCT_Caroline_NoAbby": "I can't BELIEVE Abigail would waste the kids' time like this.$3",
    "ItTakesAVillage_AbigailVideoGamesCT_Pierre_YesAbby": "I agree with Caroline. Abigail redeemed herself ahead of time by teaching the young ones something that would be covered in school.",
    "ItTakesAVillage_AbigailVideoGamesCT_Pierre_NoAbby": "%Pierre is speechless.",
    "ItTakesAVillage_AbigailVideoGamesCT_Sebastian_YesComputerYesAbby": "Hmph I guess I could have taken the easy route and showed the kids how to play games too...$s#$b#What do you mean Abigail gave them other actual lessons?!#$b#Maybe I can redeem myself by showing them how to play pool?",
    "ItTakesAVillage_AbigailVideoGamesCT_Sebastian_YesComputerNoAbby": "Hmph I guess I could have taken the easy route and showed the kids how to play games too...$s#$b#Maybe I can redeem myself by showing them how to play pool?",
    "ItTakesAVillage_AbigailVideoGamesCT_Sebastian_NoComputerYesAbby": "Hmph I guess I could have taken the easy route and showed the kids how to play games too...#$b#What do you mean Abigail gave them other actual lessons?!#$b#Is it too late to change the lesson to showing them how to play pool?$s",
    "ItTakesAVillage_AbigailVideoGamesCT_Sebastian_NoComputerNoAbby": "Hmph I guess I could have taken the easy route and showed the kids how to play games too...#$b#Is it too late to change the lesson to showing them how to play pool?$s",
    "ItTakesAVillage_AbigailVideoGamesCT_Jas": "",
    "ItTakesAVillage_AbigailVideoGamesCT_Vincent": "%Vincent is singing a familiar song.",
    "ItTakesAVillage_AbigailVideoGamesCT_Jodi": "",
    "ItTakesAVillage_AbigailVideoGamesCT_Kent": "",
    "ItTakesAVillage_AbigailVideoGamesCT_Sam_YesMusic": "Kinda feel like Abigail showing the kids video games is cheating for popularity points...$s#$b#At least Vincent enjoyed jamming out with me!s",
    "ItTakesAVillage_AbigailVideoGamesCT_Sam_NoMusic": "Kinda feel like Abigail showing the kids video games is cheating for popularity points...$s",
    "ItTakesAVillage_AbigailVideoGamesCT_Marnie": "",
    "ItTakesAVillage_AbigailVideoGamesCT_Shane": "",
    "ItTakesAVillage_AbigailVideoGamesCT_Penny": "That's an interesting choice...$3.#$b#At least, um... they're learning about having good reflexes?$3#$b#%Penny lets out a puff of air.", // test the % text box
    //
    // Wrap up event
    "event-31032041.01": "That cake looks yummy!$h",
    "event-31032041.02": "Now now, Vincent, remember what Mr. Alex taught you. Healthy foods first.",
    "event-31032041.03": "Oi Gus, she's going to be here any minute!",
    "event-31032041.04": "Alright everyone, positions, please!",
    "event-31032041.05": "SURPRISE!",
    "event-31032041.06": "Surprise!",
    "event-31032041.07": "Surprise honey!",
    "event-31032041.08": "Nice job!",
    "event-31032041.09": "Well done, Penny!",
    "event-31032041.10": "Thanks Ms. Penny!",
    "event-31032041.11": "Alright, Penny!",
    "event-31032041.12": "Oh wow...$l",
    "event-31032041.13": "What's all this, Gus?$l",
    "event-31032041.14": "Emily and I wanted to show appreciation for our teachers, and to you, for organizing the lessons!$h",
    "event-31032041.15": "It was a lot to coordinate. Thank you, Penny!",
    "event-31032041.16": "Indeed! I'm impressed you took on the challenge. I heard good things about the lessons.$h",
    "event-31032041.17": "That's my girl!$h",
    "event-31032041.18": "Our teachers should get credit as well.$l#$b#Thank you all for your dedication!$h",
    "event-31032041.19": "Love you Penny!",
    "event-31032041.20": "With that, let's eat!$h",
    "event-31032041.21": "Sounds like an exciting night!$8",
    "event-31032041.22": "Hmm... I suppose it does.#$b#I wouldn't have volunteered to teach the youth the ways of the arcane.",
    "event-31032041.23": "Well, my friend, did Penny ask you?",
    "event-31032041.24": "That's neither here nor there."
}