{
    // ***Config Options***
    //
    // Minimum Days Between Lessons
    "config.MinimumDaysBetweenLessons.name": "MinimumDaysBetweenLessons",
    "config.MinimumDaysBetweenLessons.description": "After kicking off the lessons, at least 7 days must pass between the lessons by default. This means it'd take at least 16 weeks in-game to see all the lessons. If you'd like to reduce the time between lessons to see them faster, or increase the time to spread out the lessons even more, you can! These are your options for minimum days between lessons: 1, 2, 3, 4, 6, 7, and 14 days.",
    "config.MinimumDaysBetweenLessons.values.1": "1",
    "config.MinimumDaysBetweenLessons.values.2": "2",
    "config.MinimumDaysBetweenLessons.values.3": "3",
    "config.MinimumDaysBetweenLessons.values.4": "4",
    "config.MinimumDaysBetweenLessons.values.6": "6",
    "config.MinimumDaysBetweenLessons.values.7": "7",
    "config.MinimumDaysBetweenLessons.values.14": "14",
    //
    // Skippable
    "config.SkippableConfig.name": "SkippableConfig",
    "config.SkippableConfig.description": "Specify if you want the events in the series to be skippable (true, false). Default is false. If you skip the first event with Penny by the Museum, you will not see the rest of the events. Useful for repeat playthroughs if you don't want the entire series to play. You can also skip events later in the series.",
    "config.SkippableConfig.values.true": "true",
    "config.SkippableConfig.values.false": "false",
    //
    // Edit Penny 8 Heart Event // Add note about compat
    "config.EditPenny8HeartEvent.name": "EditPenny8HeartEvent",
    "config.EditPenny8HeartEvent.description": "For immersion reasons, Penny's 8 heart event is tweaked to include a reference to the lessons. Set this to false if you have another mod that edits Penny's 8 heart event. Default is true.",
    "config.EditPenny8HeartEvent.values.true": "true",
    "config.EditPenny8HeartEvent.values.false": "false",
    //
    //
    // ***Event and CT strings***
    // Penny Kickstarts Lessons event
    "events-31032022.01": "Hi @...$s",
    "events-31032022.02": "What's got you down, Penny?",
    "events-31032022.03": "Lovely day, isn't it?",
    "events-31032022.04": "Is it that obvious?$s",
    "events-31032022.05": "I suppose it is...$s",
    "events-31032022.06": "I'm concerned about how my lessons are going with the kids.$3#$b#I'm worried that they may be losing interest when it's always me teaching, and my materials are limited.$s",
    "events-31032022.07": "Maybe I could get some of the people around town to be guest lecturers!$h#$b#They can share some of what they know with the kids. What do you think?",
    "events-31032022.08": "I think that's a great idea!",
    "events-31032022.09": "If you say so.",
    "events-31032022.10": "The kids wouldn't pay attention anyways.",
    "events-31032022.11": "I'm glad you agree! It'll spice things up to have different teachers.$h",
    "events-31032022.12": "Yes, I think this will work!",
    "events-31032022.13": "I don't think that's fair to say.$a#$b#They love new topics in class. I really think that they would enjoy hearing from other people too.$3",
    "events-31032022.14": "Well, I better get going. I have a lot of people to convince to give lessons!$l",
    // Penny Kickstarts Lessons CTs
    "ItTakesAVillage_BeginningCT_Jodi": "Hmm. I hope Vincent doesn't come home with strange facts.$2",
    "ItTakesAVillage_BeginningCT_Kent": "Vincent said Penny's getting the townspeople involved in classes.#$b#It's good she's taking their education seriously.$h",
    "ItTakesAVillage_BeginningCT_Sam": "I hope Penny asks me about teaching a class. I'm stoked to 'dispense knowledge'.$h",
    "ItTakesAVillage_BeginningCT_Marnie": "I'm glad Jas will learning different things in class. It'll be good to get her thinking.$h",
    "ItTakesAVillage_BeginningCT_Shane": "Jas has been talking up a storm about guest lecturers. If Penny's asking everyone in town, it could go badly.$2#$b#What? Not everyone is suited for teaching.$3",
    //
    // Alex PE and Healthy Eating CTs
    "ItTakesAVillage_AlexPECT_Alex": "",
    "ItTakesAVillage_AlexPECT_Jas": "",
    "ItTakesAVillage_AlexPECT_Vincent": "",
    "ItTakesAVillage_AlexPECT_George": "",
    "ItTakesAVillage_AlexPECT_Evelyn": "",
    "ItTakesAVillage_AlexPECT_Jodi": "I wish Alex had specified running *outside*...$2#$b#At least Vincent seems more excited about eating fish.",
    "ItTakesAVillage_AlexPECT_Kent": "",
    "ItTakesAVillage_AlexPECT_Sam": "",
    "ItTakesAVillage_AlexPECT_Marnie": "",
    "ItTakesAVillage_AlexPECT_Shane": "",
    "ItTakesAVillage_AlexPECT_Penny": "",
    //
    // Abigail Economics event
    "events-31032027.01": "Alright kiddos! Who's up for a little econ 101?$h",
    "events-31032027.02": "Hi @, I was just about to start a little lesson.",
    "events-31032027.03": "Hopefully this goes well today...$3",
    "events-31032027.04": "Ok, for our first example: Gus comes into Dad's store to buy some supplies for the Saloon.#$b#If he wants to buy 3 boxes wheat flour at 100 each, 1 jar of sugar at 100 each, and 2 bottles of vinegar at 200 each,#$b#what's the total Gus owes?",
    "events-31032027.05": "Um, Ms. Abigail, could you repeat the question?$3",
    "events-31032027.06": "Sure! This time I'll get some visual aids.$h",
    "events-31032027.07": "3 boxes of wheat flour costing 100 each,",
    "events-31032027.08": "1 jar of sugar costing 100 each,",
    "events-31032027.09": "2 bottles of vinegar costing 200 each.",
    "events-31032027.10": "Hopefully all the props don't inconvenience anyone trying to shop.",
    "events-31032027.12": "Ha, if anyone complains I'll tell them it's in the name of education.$h",
    "events-31032027.13": "Ms. Abigail, I think I know!",
    "events-31032027.14": "Well come on up here and tell me, let's give Vincent a chance to work through it.",
    "events-31032027.15": "That's correct!$h",
    "events-31032027.16": "800?!",
    "events-31032027.17": "You got it!$h",
    "events-31032027.18": "Ok, now what happens if Gus only has 1000? How much change would he get?",
    "events-31032027.19": "Right again!$h",
    "events-31032027.20": "200?",
    "events-31032027.21": "You got it again! Great crowd!$h",
    // Abigail Economics CTs
    "ItTakesAVillage_AbbyEconCT_Abigail": "I'm glad I got both of the kiddos involved in the lesson, at their own pace.",
    "ItTakesAVillage_AbbyEconCT_Sebastian_YesSebComputer": "I guess basic arithmetic was more their speed...$s",
    "ItTakesAVillage_AbbyEconCT_Sebastian_NoSebComputer": "Hmm, basic arithmetic? I think what I have in store is more exciting.",
    "ItTakesAVillage_AbbyEconCT_Jas": "Ms. Abigail is such a good teacher.",
    "ItTakesAVillage_AbbyEconCT_Vincent": "I'd take another class with Ms. Abigail any day!",
    "ItTakesAVillage_AbbyEconCT_Caroline": "I wouldn't have expected Abby to enjoy teaching so much. I'm happy she found this outlet.",
    "ItTakesAVillage_AbbyEconCT_Pierre": "Thankfully Abigail straightened up after her class was over.#$b#... Alright, I suppose I'm also proud she took an interest in the business.$h",
    "ItTakesAVillage_AbbyEconCT_Jodi": "Vincent came home rattling off numbers nonstop...$2",
    "ItTakesAVillage_AbbyEconCT_Kent": "That young lad was... excitable.",
    "ItTakesAVillage_AbbyEconCT_Sam": "Uh... I never would have guessed Vincent would like math this much. Guess we're different there.$10",
    "ItTakesAVillage_AbbyEconCT_Marnie": "Jas looked so proud after the math class.#$b#I'm glad it went well.$h",
    "ItTakesAVillage_AbbyEconCT_Shane": "Jas has been counting her toys and pretending she's selling them.#$b#Maybe the class got her thinking about being an entrepreneur!$6",
    "ItTakesAVillage_AbbyEconCT_Penny": "Abigail's examples were great for the kids to visualize the concepts!",
    //
    // Sebastian Computer Basics event
    "events-31032028.01": "This is an odd spot.$3",
    "events-31032028.02": "Gunther here was particular about the space.",
    "events-31032028.03": "Indeed. I don't like anyone moving my furniture.",
    "events-31032028.04": "Alright, let's get to it.",
    "events-31032028.05": "I already booted up the computer and have Turtle open.",
    "events-31032028.06": "The program most people start with is getting the console to print text.",
    "events-31032028.07": "Mr. Sebastian... what's a program?$3",
    "events-31032028.08": "It's just a set of instructions to control a computer. We'll use a simple print function.",
    "events-31032028.09": "We use parentheses to indicate we're calling a function, but they can also be used to create new objects.",
    "events-31032028.10": "Meanwhile, we use the quotation marks to indicate that we're trying to display string literals, or characters.",
    "events-31032028.11": "Let's stay focused on what Sebastian is trying to show us.",
    "events-31032028.12": "Nothing's happening.$3",
    "events-31032028.13": "The program takes time to run.",
    "events-31032028.14": "Hello world",
    "events-31032028.15": "All your bases are belong to me!",
    "events-31032028.16": "See? There!#$b#I can use Turtle to make the computer do all kinds of stuff!$h",
    "events-31032028.17": "Um... ok.$3#$b#Thank you, Mr. Sebastian.",
    "events-31032028.18": "When Ms. Abigail showed us a computer, it had a lot more flashing lights and it was fun.$3",
    "events-31032028.19": "That's a different kind of computer.$a",
    // Sebastian Computer Basics CTs
    "ItTakesAVillage_SebComputerCT_Sebastian": "I'm... not really sure how that class went, to be honest.",
    "ItTakesAVillage_SebComputerCT_Abigail_NoEconYesVG": "Pff, as if Seb's programming had a chance after I introduced the kiddos to gaming.$h",
    "ItTakesAVillage_SebComputerCT_Abigail_NoEconNoVG": "Hehe, I think my interactive math class will go over better.",
    "ItTakesAVillage_SebComputerCT_Abigail_YesEconYesVG": "Pff, as if Seb's programming had a chance after I wowed the kids with an interactive math class AND introduced themselves to gaming.$h",
    "ItTakesAVillage_SebComputerCT_Abigail_YesEconNoVG": "Hehe, the kids definitely had more fun in my interactive math class.",
    "ItTakesAVillage_SebComputerCT_Jas": "Controlling a computer doesn't seem fun.$3",
    "ItTakesAVillage_SebComputerCT_Vincent": "I guess Mr. Sebastian plays with a turtle in the computer. It doesn't look like a turtle though.$3",
    "ItTakesAVillage_SebComputerCT_Robin": "I wasn't sure how well Sebastian would do with the kids...#$b#Maybe older students would be easier for him to teach?",
    "ItTakesAVillage_SebComputerCT_Maru": "It's a shame Jas and Vincent weren't all that interested in programming.#$b#Still, their interests may lie elsewhere.",
    "ItTakesAVillage_SebComputerCT_Jodi": "I'm glad Vincent wasn't enthused about computers.#$b#Don't need his brain rotting with screen time.",
    "ItTakesAVillage_SebComputerCT_Kent": "I'm not proud to admit it, but I'm relieved Vincent wasn't interested in Sebastian's class.#$b#I wouldn't be able to help him operate that doohickey.",
    "ItTakesAVillage_SebComputerCT_Sam": "Don't tell Seb, but I'm pumped I'll stay number one in Vincent's heart.",
    "ItTakesAVillage_SebComputerCT_Marnie": "Jas didn't seem very excited about Sebastian's class. I wonder what happened.$3",
    "ItTakesAVillage_SebComputerCT_Shane": "Pff, of course that recluse didn't do well with kids.$3#$b#What are you looking at?",
    "ItTakesAVillage_SebComputerCT_Penny": "The kids were not very talkative about this lesson...$3",
    //
    // Demetrius Botany
    "events-31032029.01": "Greetings, young ones! Are you ready for some nature watching?$h",
    "events-31032029.02": "First up on our tour, a conifer tree of the family Pinaceae! More commonly known as a pine tree. Its seeds are the pinecones, famously used for decorations.#$b#But, did you know some cultures grind pinecones and use them as flour? It's a great source of protein!",
    "events-31032029.03": "My mom just buys flour.$3",
    "events-31032029.04": "*ahem* Moving right along!",
    "events-31032029.05": "Ah, here we have some seasonal forage!",
    "events-31032029.06": "Salmonberry is rubus spectabilis, part of the rose family Rosaceae.#$b#From a botanical perspective, it's not a real berry, but an aggregate fruit!$3#$b#They prefer coastal areas with nitrogen-rich soils, like moist forests and streambanks.",
    "events-31032029.07": "Spice berry is ardisia crenata, part of the primrose family, Primulaceae.#$b#In some parts of Ferngill, it's what's known as an invasive species,$2#$b#because it competes with native plants and can either eliminate or hybridize with them.$2",
    "events-31032029.08": "Blackberry is a genus Rubus in the family Rosaceae.#$b#From a botanical perspective, it's not a real berry, but an aggregate fruit!$3#$b#Still, they are quite hardy, and thrive even in poor soil like wastelands, ditches, and vacant lots.",
    "events-31032029.09": "Holly is Ilex aquifolium in the family Aquifoliaceae.#$b#From a botanical perspective, it's not a real berry, but a drupe!$3#$b#If a person eats holly, they will get sick, but it's an important food for birds and others animals.",
    "events-31032029.10": "Mr. Demetrius, what's nitrogen?$3",
    "events-31032029.11": "Mr. Demetrius, what does hybridize mean?$3",
    "events-31032029.12": "Mr. Demetrius, what's an aggregate fruit?$3",
    "events-31032029.13": "Mr. Demetrius, what's a drupe?$3",
	"events-31032029.14": "Great question, Vincent! Nitrogen is the most common element in the universe.#$b#For plants, it's a nutrient that helps keep them healthy. Like a vitamin does for humans!$h",
	"events-31032029.15": "Great question, Vincent! When one plant hybridizes with another, it means they reproduce together.#$b#The spice berry is 'joining' the native plants if it doesn't kill them off!$2",
    "events-31032029.16": "Great question, Vincent! An aggregate fruit is made of many smaller drupelets.#$b#One drupe is a fruit with an outer flesh surrounding a shell with a seed inside.#$b#Our blackberry has company in the aggregate fruit club with raspberries!",
	"events-31032029.17": "Great question, Vincent! A drupe is a fruit with an outer flesh surrounding a shell with a seed inside.#$b#Our holly has company in the drupe club with peaches!",
    "events-31032029.18": "Any other ques-",
    // Demetrius Botany Birb edition
    "events-31032029.19": "Did you hear that?",
    "events-31032029.20": "Aren't we lucky? That was a greater glossy puffle, right here in the valley!$6",
    "events-31032029.21": "Um... I don't think that's right...$3",
    "events-31032029.22": "Aha, a lot of people think it looks like a grand fluffy crow! They look very similar, but there's certain key differences if you look closely.$h#$b#Did you notice the bill, legs, and feet, how yellow they were?#$b#That's how you know.$h",
    "events-31032029.23": "Ok. Thank you, Mr. Demetrius.$3",
    "events-31032029.24": "You're welcome! Let's continue with the nature tour.$h",
    // Demetrius Botany Bug edition
    "events-31032029.25": "Aren't we lucky? That was an iridescent borer-scarab, right here in the valley!$6",
    "events-31032029.26": "Um... I think they're common here, I've heard the man from the guild say they live in the mines...$3",
    "events-31032029.27" :"That's still a treat for us, Jas! We're not likely to venture in there.$h#$b#After all, it's not safe.#$b#There are also unique crabs and a whole host of other creatures. What I would give to be able to study them safely.",
    "events-31032029.28": "That's so cool, Mr. Demetrius!",
    "events-31032029.29": "Well, let's continue with the nature tour.$h",
    // Demetrius Botany CTs
    "ItTakesAVillage_DemetriusBotanyCT_DemetriusCrow": "It was great to share botany knowledge with more than just Maru, although of course that's great too.$h#$b#Oh, the greater glossy puffle? Yes, it was quite a marvelous sight.",
    "ItTakesAVillage_DemetriusBotanyCT_DemetriusBug": "Maybe I could talk to the guild about a guided expedition into the mines?$3#$b#For science!",
    "ItTakesAVillage_DemetriusBotanyCT_RobinCrow": "Demetrius is brave to have underreacted as much as he did to that... what did he call it? 'Greater glossy puffle'?$h#$b#I would have run back into the house!$h",
    "ItTakesAVillage_DemetriusBotanyCT_RobinBug": "It was nice to hear Demetrius was able to share some of his love of science with the kids.",
}